a=int(input('введите длину стороны треугольника a = '))
b=int(input('введите длину стороны треугольника: b = '))
c=int(input('введите длину стороны треугольника: c = '))

if (a+c)>b and (a+b)>c and (b+c)>a:
    print("Треугольник существует")
    
    if a==c and c==b and a==b:
        print("Треугольник является равносторонним")
        
    elif a!=c and c!=b and a!=b:
        print("Треугольник является разносторонним")
        
    elif (a==c and a!=b) or (c==b and c!=a) or (a==b and a!=c):
        print("Треугольник является равнобедренным")
else:
    print("Треугольник не существует")
